### Задача 1
(А. Кабанов) Назовём маской числа последовательность цифр, в которой также могут встречаться следующие символы:  
— символ «?» означает ровно одну произвольную цифру;  
— символ «*» означает любую последовательность цифр произвольной длины; в том числе «*» может задавать и пустую последовательность.  
Например, маске 123*4?5 соответствуют числа 123405 и 12300425. Среди натуральных чисел, не превышающих 109, найдите все числа, соответствующие маске 1?34567?9 и делящиеся на 17 без остатка. В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, а во втором столбце — соответствующие им частные от деления на 17.

```
for t in range(10):
    for x in range(10):
        if (int('1'+str(t)+'34567'+str(x)+'9'))%17==0:          print(int('1'+str(t)+'34567'+str(x)+'9'),int('1'+str(t)+'34567'+str(x)+'9')//17)
```

### Задача 2
Пусть М – сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то значение М считается равным нулю. Например, для числа 20 имеем М = 2 + 10 = 12. Напишите программу, которая перебирает целые числа, меньшие 800 000, в порядке **убывания** и ищет среди них такие, для которых значение М оканчивается на 2. В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке **возрастания**, а во втором столбце – соответствующие им значения М.
```
def Mchislo(i):
        m=0
        for t in range (2,int(i**0.5)):
            if i%t==0:
                m=(i//t)+t
                if m%10==2:
                    return i,m
                else:
                     break
        return 0
final=[]
for i in range(799999,0,-1):
     if Mchislo(i)!=0:
        final.append(Mchislo(i))
        if len(final)==5:
            final.sort()
            print(final)
            break
```


### Задача 3
(ЕГЭ-2024) Напишите программу, которая перебирает целые числа, большие 800 000, в порядке возрастания и ищет среди них такие, у которых есть натуральный делитель, оканчивающийся на цифру 9 и не равный ни самому числу, ни числу 9. В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке возрастания, а во втором столбце – соответствующий минимальный делитель для каждого числа, оканчивающийся цифрой 9, не равный ни самому числу, ни числу 9. Строки выводятся в порядке возрастания найденных чисел.

```
def delitel9 (r):

    for i in range (19,r-1,10):

        if r%i==0:

            return (r,i)
    return 0
final = []
t=800000
while len(final)<5:
    t+=1
    if delitel9(t)!=0:
        final.append(delitel9(t))
print(final)
```