Время выполнения - 14 минут


### О задании
Задание 17 ЕГЭ по информатике нацелено на проверку умений перебора последовательности целых чисел. В данном задании предстоит работать с текстовым файлом, в каждой строке которого находится целое число. В зависимости от задания эти числа могут быть как положительными, так и отрицательными, что незначительно, но все же влияет на решение задания.

В целом, основная сложность данного задания в его витиеватой и запутанной формулировке. Ваша цель здесь – вдумчиво прочитать текст задания и выписать все необходимые условия, которым должны отвечать подходящие числа. В ответ всегда требуется дать 2 числа: количество подходящих пар или троек чисел и результат какого-либо выражения с ними (максимальная сумма элементов, минимальная сумма квадратов и т.д.).


### Окрытие/закрытие файла

```python
f = open("название файла")
```

### Чтение содержимого файла
- открыли
```python
f = open("название файла")
```
- считали данные
При считывании файл с кириллицей указываем кодировку utf-8
```python
f = open("17.txt", encoding="utf-8")

s1 = f.read()  #в переменную сохраняется весь файл 
# ввиде одной строки! (даже если написанно много строк)

print(type(s1))
f.close

f = open("17.txt", encoding="utf-8")
a = list(map(int,f.read().strip().split('\n')))
print(a)
```

```
1
2
3
s=f.read
```

```python
s2 = f.readline() #в переменной храниться одна строка
```

```python
s2 = f.readlines() #в переменной сохраняется каждая строчка файла
#в виде элемента списка

A = list(map(int, f.readlines()))

#закрыли
f.close()
```


### Менеджер контекста

```python
with open('17.txt') as file:
	A = list(map(int, file.readlines()))
```

```python
a=[]
with open('1.txt') as file:
	for x in file:
		a.append(int(x))
```




```
файл: 1\n2\n3\n
```
```python
f = open('имя файла.расширение', encoding = "utf-8")
s1 = f.read() # в переменную сохраняется весь файл в виде строки
a = [s1] # хранится как ['1\n2\n3\n']. лучше хранить и использовать так
```

```python
a = list(map(int, f.read().strip().split("\n")))
```
```python
stroka.strip() # очищвает строку от служебных символов
```
```python
a = f.redline() # считывает только одну строчку
a = f.readlines() # читает все строки от курсора и ниже и сохраняет их в список
A = list(map(int, f.readlines()))
```
### менеджер контекста
Самым удобным способом является такой: записать файл в список, для дальнейшей работы в цикле.
№ 1
```python
with open(...) as f:
	A = list(map(int, f.readlines()))
```
№ 2
```python
a = []
with open(...) as f:
	for x in f:
		a.append(int(x))
```

### Анализ полученного списка и поиск решения
 Часто в задании просят анализировать не одно число из списка, а пару или тройку чисел. В таких случаях цикл будет выглядеть так: 
```python 
for i in range(0, len(a)-1): # "окно" из 2 чисел - a[i] и a[i+1]
for i in range(0, len(a)-2): # "окно" из 3 чисел - a[i], a[i+1] и a[i+2]
# и так далее, но больше 3 почти не встречается(если вообще существует)
```
 В основном цикле удобным для дебага является **метод флагов** - проверять условия с помощью переменных - "флагов". Каждому флагу присваивается истинность какого-то требуемого условия, например, простота числа, длина и т. п. 
```python
f1   = 1 if s%minim != 0 else 0      # делимость числа на minim
ff1  = str(a[i])[-1] == "4"          # оканчивается ли число a[i] на 4
ff2  = str(a[i+1])[-1] == "4"        # оканчивается ли число a[i+1] на 4
f2   = (not ff1)*ff2 + ff1*(not ff2) # только одно число далжно оканчиваться
#                                      на 4
if f1*f2: ans.append(s)              # если условия f1 и f2 выполнены, сумма
#                                      пар идет в ответ
```

### Задача 1

>(Н. Сафронов) В файле [17-385.txt](https://kpolyakov.spb.ru/cms/files/ege-seq/17-385.txt) содержится последовательность целых неотрицательных чисел, не превышающих 10000. Определите количество пар элементов последовательности, в которых каждое число больше максимального из тех элементов последовательности, сумма цифр которых минимальна. В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму цифр элементов таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
  
  
```python
def prost(x):
    dels=0
    for i in range (2,int(x**0.5)+1):
        if x%i==0:
            dels+=1
    if dels==0:
        return 1
    else:
        return 0
        
f = open("17-386.txt")

count=0
minsum=100000
a = list(map(int,f.read().strip().split('\n')))


for i in range (len(a)-2):
    x,y,z = a[i:i+3]
    if ('3' in str(x)) and ('3' in str(y)) and ('3' in str(z)):
        if prost(x+y+z)==1:
            if x+y+z<minsum:
                minsum=x+y+z
            count+=1
            
print(count,minsum)
f.close()
```

### Задача 2

>(В. Шубинкин) В файле [17-1.txt](https://kpolyakov.spb.ru/cms/files/ege-seq/17-1.txt) содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10 000 до 10 000 включительно. Определите и запишите в ответе сначала количество элементов последовательности, которые больше предыдущего элемента, затем наименьший модуль разности чисел в паре среди всех таких пар. В данной задаче под парой подразумевается два идущих подряд элемента последовательности. Например, для последовательности 307; 36; 45; -27; -11; -6; 2; -16 ответом будет пара чисел: 4 и 5.

``` python
f.open("")
a = list(map(int,f.read().strip().split('\n')))
count=0
minmod=1000000
for i in range(len(a)-1):
   x,y = a[i:i+2]
   if x<y:
      count+=1
      raz = abs(x-y)
      if minmod>raz:
         minmod=raz

print(count,minmod)
```

### Задача 3
(А. Кабанов) В файле [17-4.txt](https://kpolyakov.spb.ru/cms/files/ege-seq/17-4.txt) содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, больших 100, которые удовлетворяют следующим условиям:
− цифра в разряде десятков не превышает 4;
− цифра в разряде сотен принадлежит отрезку [3; 7].
Найдите количество таких чисел и минимальное из них.
``` python
f.open("")
a = list(map(int,f.read().strip().split('\n')))

minp = 1000000
count=0
for i in range(len(a)):
   n = a[i]
   if n>100:
      if (n%100)//10<5 and (3<=(n%1000)//100) and (7>=(n%1000)//100):
         count+=1
         if n<minp: minp=n

print(count,minp)
```

### Задача 4
(А. Кабанов) В файле [17-4.txt](https://kpolyakov.spb.ru/cms/files/ege-seq/17-4.txt) содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно. Рассматривается множество элементов последовательности, которые удовлетворяют следующим условиям:
− сумма цифр числа кратна 5;
− троичная запись числа не заканчивается на 00.
Найдите количество таких чисел и наибольший из них.
``` python
def perevod(n,p):
x=[]
   while n>0:
      x.append(n%p)
      n=n//p
   x.reverse()
   return x

def perevod2(x,n,newx=''):
   while x>0:
      newx=str(x%n)+newx
      x//=n
   return newx
      

f=open("damb.txt")

a = list(map(int,f.read().strip().split('\n')))
count=0
maxn = 0
for i in range (len(a)):
   n=a[i]
   zifr=0
   for k in str(n):
      zifr+=int(k)
   if zifr%5==0 and int(perevod2(n,3))%100!=0:
      count+=1
      if n>maxn:
         maxn=n
print(count,maxn)
```

### Задача 5
``` python
```

### Задача 6
``` python
```
### Самостоятельное решение:
https://kpolyakov.spb.ru/index.htm
4272, 4315, 4316, 4354, 4656, 4666, 4669, 4689, 4701
4899, 4718, 5130, 5181, 5211, 5246, 5250, 5283, 5285, 5328, 5373
6642, 6757, 6759, 6761, 6831, 6893, 7079, 7226, 7228, 7390, 7429.
7485, 7487, 7563, 7627, 7679, 7814, 7986, 7989