Задание номер 8 — задание базового уровня сложности, выполнение которого предполагает знание о методах измерения количества информации и не требует использования специального ПО.

Зачастую в номере 8 мы можем встретить задания связанные с комбинаторикой — перестановками, количеством вариантов выборки и т.д. Для решения заданий такого типа можно приспособить [[модуль itertools]] языка python.



## МОИ РЕШЕНИЯ
Задания взяты из [8in.pdf](file:///C:/Users/egort/Downloads/8in.pdf)

### Задание 8.1 

Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 4-буквенные слова, в которых могут быть только буквы П, Р, И, К, А, З, причем буква К появляется ровно 1 раз. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться вовсе. Сколько различных кодовых слов может использовать Игорь?

```
from itertools import product

d = "ПРИКАЗ"
K=0
comb = product(d,repeat=4)

for item in comb:
	if ''.join(item).count(К)==1:
		K+=1
print(K)

```

ОТВЕТ: 500

### Задание 8.2

Петя составляет 7-буквенные слова из букв В, Е, Б, И, Н, А, Р. Каждую букву нужно использовать ровно 1 раз, при этом код при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Петя?

Проще комбинаторикой:
т.к. мы не можем ставит 2ух согласных игласных подряд идущими, то гласные мы можем ставить исключительно на нечетные позиции(их 4), а гласные на четные(их 3)
соответственно всего комбинаций будет ($4!*3! = 3^{2}\cdot2^{2}\cdot4\cdot1^{2}=144$)

### Задание 8.4 
Пётр составляет слова длиной 6 букв, которые начинаются с гласной буквы. Всего он смог составить 486 <u>комбинаций</u> слов. Сколько согласных букв использует Петр для составления слов, если известно, что в используемом алфавите только две гласные? Каждая буква может входить в слово несколько раз.

Тоже комбинаторикой

**$\sqrt[5]{\frac{486}{2}}=3$**

### Задание 8.5
Все четырёхбуквенные слова, составленные из букв В, И, Н, О, Г, Р, А, Д записаны в алфавитном порядке и пронумерованы, начиная с 1. Начало списка выглядит так: 
1. АААА 
2. АААВ 
3. АААГ 
4. АААД 
5. АААИ 
6. АААН 
7. АААО 
8. АААР 
9. ААВА … 
Под каким номером в списке идёт первое слово, которое начинается с ИР?

```
from itertools import permutations,product
comb = produst("АВГДИНОР",repeat=4)
k=0
for item in comb:
    k+=1
	if item[0]=="И" and item[1]=="Р":
		break


```



### Задание 8.7 
Вася составляет 7-буквенные коды из букв Н, О, Б, Е, Л, И, Й. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Й и не может содержать сочетания ИЙО. Сколько различных кодов может составить Вася?

```
from itertools import permutations
comb = permutations("НОБЕЛИЙ")
k=0
for item in comb:
    if ''.join(item).count("ИЙО")==0 and item[0]!="Й":
        k+=1
print(k)
```