> *задание 15 можно всего на 2 типа: задания на поиск целого значения А из неравенств и задания на поиск длины отрезка А. Также существует и некий гибрид этих двух типов. В таких заданиях предстоит работать как с отрезками, так и с неравенствами в логических выражениях. Причем «гибридные» задания вполне могут попасться вам на экзамене.*


#### Напомню эквивалентные переходы от логики к питону 

1. Инверсия ¬B: (not (B))
2. Конъюнкция A ∧ B: (A and B)
3. Дизъюнкция A ∨ B: (A or B)
4. Импликация  A → B:  (A <= B)


## Тип(1) 1
>«Для какого наибольшего целого неотрицательного числа A выражение\
(x + y <= 30) ∨ (y <= x + 2) ∨ (y >=A)\
тождественно истинно, т.е. принимает значение 1 при любых целых положительных x и y?»

```py
def f(x, y, A):
    return (x + y <= 30) or (y <= x+2) or (y >= A)

for A in range(0, 50)[::-1]:
    if all(f(x, y, A)
           for x in range(1, 50)
           for y in range(1, 50)):
        print(A)
        break
```

## Тип(1) 2

Задания данного типа примечательны тем, что здесь нам предстоит реализовать какую-то функцию, которая не представлена среди базовых логических операций. В подавляющем большинстве заданий такой функцией будет «ДЕЛ(n, m)».

Эта функция обозначает утверждение «натуральное число n делится без остатка на натуральное число m». То есть можем записать её таким выражением:
```
n % m == 0
```
Рассмотрим такую формулировку:
>«Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». Для какого наименьшего натурального числа A логическое выражение\
(ДЕЛ(x, 9) →  ¬ ДЕЛ(x, 6)) ∨ (x + A ≥ 100)\
истинно (т.е. принимает значение 1) при любом целом положительном значении переменной x?»
```py 
def f(x, A):
    return ((x % 9 == 0) <= (x % 6 != 0)) or (x + A >= 100)


for A in range(1, 500):
    if all(f(x, A) for x in range(1, 500)):
        print(A)
        break
```


## Тип(1) 3 
К третьему типу относятся задания, в условиях которых фигурирует операция побитовой конъюнкции. Но это не меняет нашего алгоритма решения от слова совсем. Так что подробно останавливаться на них не будем.

>«Обозначим через m & n поразрядную конъюнкцию неотрицательных целых чисел m и n. Так, например, 14 & 5 = 11102 & 01012 = 01002 = 4.
Для какого наибольшего целого положительного числа А выражение
(x & А = 0) ∨ ¬(x & 37 = 0) ∨ ¬(x & 12 = 0)
тождественно истинно (т.е. принимает значение 1) при любом целом значении переменной х?»

``` py
def f(x, A):
    return (x & A == 0) or (not (x & 37 == 0)) or (not (x & 12 == 0))


for A in range(1, 100)[::-1]:
    if all(f(x, A) for x in range(1, 100)):
        print(A)
        break
``` 

## Тип(2) 4
Наконец, мы переходим к самому интересному типу заданий 15. Этот тип еще называют «задание с отрезками».

В таких заданиях обычно даются два отрезка и требуется найти наименьшую или наибольшую длину некоторого отрезка А, для которого будет истинно логическое выражение.

формулировка

> «На числовой прямой  даны два отрезка: \
B = [24; 90] и C = [47; 115] \
Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение\
(x ∈ C) → ((¬(x ∈ A) ∧ (x ∈ B)) → ¬(x ∈ C))\
истинно (т.е. принимает значение 1) при любом значении переменной х.»

